<%@ page language="java" pageEncoding="utf-8"%>
<%@ taglib prefix="s" uri="/struts-tags"%>
<div class="l-w">
    <div class="apply-step">
        <ol class="ui-step ui-step-4 fn-clear">
            <li class="ui-step-start ui-step-done">
                <div class="ui-step-line">-</div>
                <div class="ui-step-icon">
                    <i class="ui-step-icon-block"></i>
                    <i class="ui-step-number">1</i>
                    <span class="ui-step-text">验证会员</span>
                </div>
            </li>
            <li class="ui-step-active">
                <div class="ui-step-line">-</div>
                <div class="ui-step-icon">
                    <i class="ui-step-icon-block"></i>
                    <i class="ui-step-number">2</i>
                    <span class="ui-step-text">确认入驻协议</span>
                </div>
            </li>
            <li>
                <div class="ui-step-line">-</div>
                <div class="ui-step-icon">
                    <i class="ui-step-icon-block"></i>
                    <i class="ui-step-number">3</i>
                    <span class="ui-step-text">提交申请表格</span>
                </div>
            </li>
            <li>
                <div class="ui-step-line">-</div>
                <div class="ui-step-icon">
                    <i class="ui-step-icon-block"></i>
                    <i class="ui-step-number">4</i>
                    <span class="ui-step-text">平台审核</span>
                </div>
            </li>
            <li class="ui-step-end">
                <div class="ui-step-line">-</div>
                <div class="ui-step-icon">
                    <i class="ui-step-icon-block"></i>
                    <i class="ui-step-number">√</i>
                    <span class="ui-step-text">确认服务协议</span>
                </div>
            </li>
        </ol>
    </div>
    <h3 class="step--sub-title">康美中药城开放平台在线入驻系统协议</h3>
    <textarea name="" id="" cols="190" rows="12"  style="width:99%;">《康美中药城开放平台在线入驻系统协议》 （以下简称“本协议”）是由康美中药城网站（www.kmb2b.com）的运营方即康美中药城（广东）发展有限公司与符合康美中药城要求的商家（以下简称“商家”）达成的关于使用康美中药城网站商家在线入驻系统（以下简称“入驻系统”）服务的各项条款、条件和规则。

    一、本协议的订立

    1.1 本协议包括本协议正文及所有平台已经发布的或将来可能制订、修订并发布的各类规则（以下简称“规则”），所有规则为本协议不可分割的组成部分，与本协议正文具有同等法律效力。在中国法律允许的最大限度内，康美中药城网站有权根据需要不时地制订、修订本协议正文及/或各类规则，并以在康美中药城网站公示的方式进行发布，不再单独通知商家。商家应及时自行阅读相关公示内容。制订、修订后的本协议正文及/或各类规则一经在康美中药城网站公布，立即生效，商家同意接受其约束。
    1.2 康美中药城网站在此特别提醒商家认真阅读、充分理解本协议各条款，并请审慎考虑并选择接受或不接受本协议。如果商家一经点击“我已阅读并同意”，即表示其接受了本协议，并同意受本协议各项条款的约束。如果不同意本协议中的任何内容，可以选择不予点击“我已阅读并同意”，在此种情况下，商家将无法使用在线入驻系统服务。

    二.	在线入驻系统使用说明

    2.1 商家通过在线入驻系统提出签约或续约申请，应按照康美中药城网站的流程要求进行相应环节手续之提交，包括但不限于如实填写商家信息、提供商家资质资料、在线审阅并同意协议文本、缴纳相应平台使用费及保证金等，经康美中药城网站审核通过后，商家正式入驻康美中药城网站。康美中药城网站将为签约商家开通商家后台系统，商家可通过商家后台系统在康美中药城网站运营自己的店铺。
    2.2	商家以及康美中药城网站通过在线签约系统做出的申请、资料提交以及审查等行为，仅为根据本协议通过在线签约系统表达合作意向、履行签约及沟通等手续的必备程序；在双方未最终签署《康美中药城开放平台服务协议》（以下简称“平台协议”）之前，对于双方不产生法律上的约束力。康美中药城网站在线审核同意商家提交之签约申请，并将审核同意结果通知到商家时（通知形式包括但不限于在线入驻系统[什么系统？系统指：商家在线入驻系统]通知、电子邮件通知等），平台协议方始成立，对双方均产生法律上的约束力。双方间最终合作事宜及运营规则均以通过在线签约系统签署的平台协议之约定及商家后台系统公示的各项规则为准。
    2.3 商家通过在线签约系统提交的材料，将由康美中药城网站自行或委托第三方对商家入驻资质进行审查，商家需按照康美中药城网站的规定，提供相应的具体信息（包括但不限于银行账号、联系方式等），并支付相应费用。

    三、商家的权利和义务

    3.1 商家应阅读康美中药城网站公示的签约商家标准，并确保资质符合公示的签约要求，商家知悉并理解康美中药城网站将结合自身业务发展情况对商家进行选择。
    3.2	商家应按照康美中药城网站要求如实提供签约申请所需资料以及相关信息，商家应确保提供的申请资料及信息合法有效、真实、准确、完整，经审核通过后，商家不得擅自修改、替换相应资料及信息。如商家提供的申请资料信息不合法、无效或失效、不真实、不准确或不完整的，由此产生的任何争议、纠纷、处罚、诉讼、仲裁、投诉、索赔等均由商家自行负责处理并承担全部法律责任（包括但不限于赔偿由此给顾客、康美中药城网站运营方、第三方造成的全部损失及相关法律责任），并且康美中药城网站运营方有权立即终止商家使用相关账户的权利，或终止与商家的部分或全部合作。
    3.3	商家应确保其使用在线入驻系统时提交的所有内容符合国家法律法规的规定和本协议的规定，不含有违法信息、木马等软件病毒或其他任何形式的垃圾信息；且商家应按本协议的规定使用在线入驻系统，不得从事影响或可能影响在线入驻系统正常运营的行为。否则，康美中药城网站运营方有权立即删除前述内容，并有权立即终止商家使用在线签约系统的权利。
    3.4	商家应注意及时查看在线入驻系统公示的签约申请结果。商家如经康美中药城网站运营方审核通过，应按照康美中药城网站运营方要求办理相关手续；如审核未通过，则可自康美中药城网站运营方将审核结果通知商家（需商家登陆入驻系统查看）之日起15 日内提出异议并提供相应资料，由康美中药城网站运营方再行审核是否通过。无论何种情形下，商家同意提交的申请资料及信息均可由康美中药城网站运营方自行处理，无需返还商家。
    3.5 商家应按照康美中药城网站运营方的规定妥善保管、使用康美中药城网站运营方提供的用户账号，不得以任何形式擅自转让或授权他人使用商家在康美中药城网站的用户帐号；否则，由此产生的任何争议、纠纷、处罚、诉讼、仲裁、投诉、索赔等均由商家自行负责处理并承担全部法律责任（包括但不限于赔偿由此给顾客、康美中药城网站运营方造成的全部损失），并且康美中药城网站有权立即终止商家使用相关账户的权利，或终止与商家的部分或全部合作。

    四、康美中药城网站运营方的权利和义务

    4.1 在线入驻系统仅为商家申请入驻康美中药城网站的平台。商家正式入驻康美中药城网站后，将在商家后台系统中运营其在康美中药城网站的入驻店铺。
    4.2	康美中药城网站运营方有权对商家提供的资料及信息进行审核，并有权结合国家法律法规的规定和自身业务情况对商家进行选择；康美中药城网站运营方对商家提交资料及信息的审核均不代表其对审核内容的合法、有效、真实、准确、完整性作出的确认，商家应保证其提供的资料及信息的合法有效、真实、准确、完整性并承担全部法律责任。
    4.3 无论商家是否通过康美中药城网站运营方的审核，康美中药城网站运营方有权对商家提供的资料及信息予以留存并随时查阅，同时，康美中药城网站运营方有义务对商家提供的资料予以保密，但国家行政机关、司法机关等国家机构调取资料的除外。
    4.4 康美中药城网站运营方应在现有技术支持的基础上确保在线签约系统的正常运营，维护在线签约系统的信息安全，尽量避免在线签约系统服务的中断给商家带来的不便。

    五、不可抗力

    5.1 不论在任何情况下，康美中药城网站运营方均不对由于互联网正常的设备维护，互联网络连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，暴乱，骚乱，灾难性天气（如火灾、洪水、风暴等），爆炸，战争，政府行为，司法行政机关的命令或第三方的不作为而造成之对商家不良影响包括但不限于商家资料泄露、丢失、被盗用、被篡改等承担任何责任。

    六、在线入驻系统服务的终止

    6.1 商家自行终止在线签约申请，或商家的在线签约申请经康美中药城网站运营方审核未通过的，则在线签约系统服务自行终止。
    6.2 商家使用康美中药城网站在线入驻系统时，违反国家相关法律法规的，或违反本协议规定的，康美中药城网站运营方有权随时终止商家使用在线入驻系统。
    6.3 商家基于在线入驻系统服务被终止后，康美中药城网站仍有权保留该商家基于在线入驻系统产生的所有信息和记录；如该商家在服务终止前存在违法行为或违反本协议的行为，康美中药城网站运营方仍可行使本协议所规定的权利。
    6.4 本协议之签署、效力、解释和执行以及本协议项下争议之解决均适用中华人民共和国法律（为本协议目的，不包括香港、澳门、台湾法律）。商家和康美中药城网站运营方在签署、履行本协议中发生的争议或纠纷，双方应通过友好协商解决；协商不成的，任何一方有权将争议提交至康美中药城网站运营方住所地人民法院诉讼解决。

    七、知识产权
    7.1 康美中药城网站上的图表、标识、网页页眉、按钮图标、文字、服务品名等标示在网站上的信息都是康美中药城网站运营方及其关联方的财产，受中国和国际知识产权法的保护。未经康美中药城网站运营方许可，任何人不得使用、复制或用作其他用途。在法律允许的最大限度范围内，康美中药城网站运营方有权对本协议及在线入驻系统的内容进行修改和解释并公示，无需另行通知商家。商家违反法律规定或本协议给康美中药城网站造成损失的，应予以全部赔偿。
    </textarea>
    <p class="ui-well ui-well-sm fn-gray fn-mt20">
        <label class="fn-mr20">
             <input class="ui-form-checkbox fn-mr5" id="checkboxAgrement" name="checkboxAgrement"
                    value="" type="checkbox">我已看过并同意《康美中药城开放平台在线入驻系统协议》
        </label>
    </p>
    <div class="apply-step-form fn-mt10 fn-text-ct">
        <form id="frm" action="goBackTwo.action" method="post" name=""
              class="ui-form ui-form-vertical fn-t20">
        <input type="hidden" id="loginId" value="${showUserinfo.loginId}" name="showUserinfo.loginId"/>
            <div class="ui-form-item">
                <a class="ui-button ui-button-default ui-button-lg fn-mr10" href="goFirstApplyPag.action">上一步</a>
                <a class="ui-button ui-button-success ui-button-lg" id="next"  href="javascript:void(0);">下一步</a>
            </div>
        </form>
    </div>
</div>