<%@ page language="java" pageEncoding="utf-8"%>
<%@ taglib prefix="s" uri="/struts-tags"%>
<div class="l-w">
    <div class="apply-step">
        <ol class="ui-step ui-step-4 fn-clear">
            <li class="ui-step-start ui-step-done">
                <div class="ui-step-line">-</div>    
                <div class="ui-step-icon">        
                    <i class="ui-step-icon-block"></i>
                    <i class="ui-step-number">1</i>
                    <span class="ui-step-text">验证会员</span>
                </div>
            </li>
            <li class="ui-step-start ui-step-done">
                <div class="ui-step-line">-</div>    
                <div class="ui-step-icon">        
                    <i class="ui-step-icon-block"></i>
                    <i class="ui-step-number">2</i>
                    <span class="ui-step-text">确认入驻协议</span>
                </div>
            </li>		    
            <li class="ui-step-start ui-step-done">
               <div class="ui-step-line">-</div>    
                <div class="ui-step-icon">
                    <i class="ui-step-icon-block"></i>
                    <i class="ui-step-number">3</i>
                    <span class="ui-step-text">提交申请表</span>
                </div>
            </li>
             <li class="ui-step-start ui-step-done">
                <div class="ui-step-line">-</div>    
                <div class="ui-step-icon">
                    <i class="ui-step-icon-block"></i>
                    <i class="ui-step-number">4</i>
                    <span class="ui-step-text">平台审核</span>
                </div>
            </li>
            <li class="ui-step-active ui-step-end">
                <div class="ui-step-line">-</div>    
                <div class="ui-step-icon">
                    <i class="ui-step-icon-block"></i>
                    <i class="ui-step-number">√</i>
                    <span class="ui-step-text">确认服务协议</span>
                </div>
            </li>
        </ol>
    </div>
    <p class="ui-well ui-well-sm fn-gray fn-mt20">
        您的商家入驻申请已经审核通过,请仔细阅读下面的《康美中药城开放平台服务协议》和核准运营类目及平台佣金比例，确认后即可进入商家平台
    </p>
    <h3 class="step--sub-title fn-mt20">康美中药城开放平台服务协议</h3>
    <textarea name="" id="" cols="190" rows="12"  style="width:99%;">
    本康美中药城开放平台服务协议（以下简称“本协议”），根据《中华人民共和国合同法》和其他相关法律法规的规定，由康美中药城网络交易平台即www.kmb2b.com（以下简称“康美中药城网站”）的运营方康美中药城（广东）发展有限公司（以下简称“甲方”）与符合康美中药城开放平台要求且接受《康美中药城在线入驻系统协议》的商家（以下简称乙方）共同订立。
    
    1.合作模式
    甲方提供康美中药城网络交易平台，乙方在甲方提供的网络交易平台上向顾客销售商品或提供服务。
    2.	甲方提供的服务
    2.1	甲方为乙方提供网络交易平台，包括在前台康美中药城网站中为乙方提供独立的网上店铺，及在后台为乙方提供支持乙方进行商品销售、促销、结算、配送等操作的软件系统。
    2.2	甲方提供的软件系统包括但不限于商品销售系统、网上支付系统、商品展示系统、后台管理系统等模块，以实现乙方自行进行商品管理、图片上传、商品促销、财务结算、店铺装修等功能。
    2.3	为保证乙方交易活动顺利进行，甲方将提供持续的技术支持服务，以不断完善现有功能模块及开发新的功能模块。
    2.4	甲方将为乙方在甲方网络交易平台销售商品或服务提供配套服务，并会根据乙方需要不断完善现有服务及开发新的服务内容。
    2.5	甲方提供的配套服务包括商品仓储服务、商品配送服务、网络营销服务等，乙方可根据自身情况选择甲方提供的该等服务，具体服务内容由双方另行签订服务协议约定。
    3.甲方权利与义务
    3.1	在商品销售过程中，甲方如发现乙方所有的或有权使用的版权及商标权被他人侵权，应及时通知乙方并提供相应帮助。
    3.2	甲方有权查阅乙方的注册数据及交易行为，发现注册数据或交易行为中存在任何问题或怀疑，均有权向乙方发出询问及要求改正的通知或者直接作出删除违规商品等处理。
    3.3	经国家生效法律文书或行政处罚决定确认乙方存在违法违规行为，或者甲方有足够事实依据可以认定乙方存在违法或违反本协议行为的，甲方有权在其网站公布乙方的违法或违规行为并要求乙方承担相应的赔偿责任或违约责任。
    3.4	乙方如违反法律、法规规定或违反本协议及本协议项下附件约定发布违规信息的，甲方有权不经通知删除乙方发布的违规信息，并有权视乙方违规情况暂时中止或终止与乙方合作。
    3.5	甲方有权根据法律法规或甲方发布的规则对乙方进行评定，并根据不同情况对乙方采取包括但不限于删除有关信息、停止对乙方提供服务并解除本合同、移交有关司法、行政机关处理、依据已发布的规则对乙方进行处罚、要求乙方承担赔偿责任等措施。
    4.	乙方的权利与义务
    4.1 乙方提供给甲方的文件资料及其复印件要求必须真实、有效、完整、清晰，并能涵盖所涉公司及销售产品类别。
    4.2 乙方所有提供的文件资料有效期必须在3个月及以上，不接受有效期在3个月以内的文件。 
    4.3 文件资料如涉及数家企业或个人，则相互关系必须明确清晰，并由各方签章确认。
    4.4 相关外文资料必要时须提供对应的中文翻译件（中文翻译件可以由翻译公司出具，也可以由申请商户出具，由商户出具的须加盖申请商户的公章）。
    4.5 乙方完成注册流程后将获得甲方提供的用户名和密码。乙方应妥善保管其用户名及密码信息，不得以任何形式擅自转让或授权他人使用自己的用户名，并对利用该用户名和密码所进行的一切活动负全部责任。
    4.6 乙方在使用甲方提供各项服务的同时，承诺接受并遵守甲方发布的规则的规定。
    4.7 乙方保证其已通过或取得销售该等商品需要的各项审批或许可，对其所售商品享有唯一的合法的所有权，且商品销售和交付未侵犯任何第三方的权利。
    4.8	乙方保证具有合法的销售权，保证其销售的商品均具有合法来源和合法授权，未侵害任何第三方的人身权利、著作权、专利权、商标权、商业秘密或其他权利。
    4.9 乙方保证其将按照《中华人民共和国产品质量法》、《中华人民共和国消费者权益保护法》及其他法律、法规、部门规章、国家标准、行业标准（无国家标准、行业标准的，可执行地方标准、经备案的企业标准）的规定出售商品并提供售后服务，且乙方保证其遵守甲方的售后服务规定。
    4.10 甲方在本协议中仅向乙方提供销售平台，对与产品和服务相关的全部内容不承担任何责任。与乙方所销售产品和所提供服务相关的售前服务、产品安全、产品质量和售后服务等全部事项，以及由该等事项引发的对顾客或第三方的责任，全部由乙方自行承担。
    4.11 乙方保证其发布于甲方的所有信息真实、准确，符合相关法律法规及甲方发布的规则的要求，未侵害任何第三方合法权利；乙方同时保证按本协议或相关规则要求履行退换货等义务。
    4.12 乙方保证在使用服务进行交易的过程中遵守诚实信用的原则，不在交易过程中采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为。 
    4.13 乙方保证在使用服务时实施的所有行为均遵守国家法律、法规和甲方的相关规定以及各种社会公共利益或公共道德。如有违反导致任何法律后果的发生，乙方应自行承担所有相应的法律责任。
    4.14 乙方同意不对甲方提供的任何数据作商业性利用，包括但不限于在未经甲方事先书面批准的情况下，以复制、传播等方式使用在甲方网站上展示的任何资料。
    4.15 因乙方的错误操作而造成的系统自动退款等损失，由乙方自行负责。
    4.16 乙方同意为其未及时通知或更新其信息承担全部责任，如因此给第三方（包括但不限于顾客、其合作伙伴、代理人、职员等）造成损失的，乙方同意自行赔偿其全部损失。
    4.17 乙方在此授权甲方，以任何方式（如复制、翻译、展示等形式）使用乙方公示于康美中药城网站的各类信息，或以现在已知或日后开发的任何形式、载体或技术，将上述信息纳入其它作品（以下简称‘许可使用权’）。乙方授予甲方在本协议有效期内无偿的许可使用权，并且甲方有权就该许可使用权进行包括但不限于市场推广行为的再授权。
    4.18 在本协议第4.17款约定的授权期限后、或本协议被提前终止或解除后，对于甲方或甲方授权的第三方在授权有效期内已经使用的乙方的各类信息，乙方同意甲方无需更换、收回或处理并无需承担任何侵权责任。
    4.19 乙方不可撤销地授权甲方按本协议（包括本协议正文及其附件）的规定在本协议有效期内依甲方的指示直接对乙方在甲方处的账户余额进行款项冻结和支付。
    4.20 鉴于乙方使用甲方的网络销售平台从事商品销售业务，乙方保证维护甲方的良好声誉和企业形象，不得作出任何有损于甲方之品牌形象和声誉的任何言论及行动。如甲方发现乙方有故意诋毁或损害甲方声誉的言行或行为的，甲方有权立即终止本协议，并将视情节追究乙方法律责任。
    4.21 未经甲方书面授权，乙方不得为任何目的和形式使用甲方商标、标志及企业商号、字号，否则，乙方承担由此引致的全部法律责任。
    4.22 乙方认可：为保障消费者权益，其需缴付消费者权益保证金；如遇顾客投诉的，经甲方根据国家法律法规的规定和康美中药城网站规则判断后，甲方将直接扣除保证金的部分或全部，用于顾客的先行赔付；如消费者权益保证金余额不足以赔付顾客损失的，乙方应根据甲方的要求及时补足，否则，由此造成的损失均由乙方全部承担。 乙方的商品或服务出现以下情况时，甲方有权对于商家的保证金进行部分或全部扣减以用于顾客的现行赔付： 
    1)、当商品或服务出现质量问题； 
    2)、当商品或服务与宣传不符； 
    3)、出售假冒伪劣商品等其他侵犯消费者权益的行为； 
    4)、其他根据国家法律法规的规定和本协议的规定（包括但不限于网站规则的规定）应予以扣除消费者权益保证金的情形。
    4.23 在本协议终止或经双方同意提前解除时，在乙方完全履行义务后，乙方可向甲方书面申请关店。如乙方在执行本协议过程中未发生违约行为（包括但不限于未发生对顾客合法权益造成损失的情形），且未因违反国家法律法规而致使甲方遭受国家有权机关处罚、被裁决赔偿等任何损失，甲方审核通过后三个月内，将保证金余额（如有，不计算利息）归还于乙方。如乙方擅自关店或以任何理由或借口停止经营行为，则甲方有权视乙方违约情形决定扣除部分或全部履约保证金。
    5  违约责任
    5.1	乙方同意赔偿由于使用服务（包括但不限于将商户资料展示在网站上）或违反本协议而给甲方造成的任何损失（包括但不限于由此产生的全额的诉讼费用和律师费），如因乙方原因导致甲方受到起诉或遭受行政部门查处或者第三方向甲方主张权利或索赔的，乙方应为甲方辩护，向甲方赔偿并使甲方免于损害。乙方同意甲方不对任何其展示的资料（包括但不限于诽谤性的、攻击性的或非法的资料）承担任何责任；由于此类材料对第三方（包括但不限于顾客）造成的损失由乙方自行全部承担。
    5.2	若乙方违反本协议的约定，甲方有权对乙方进行包括但不限于关闭店铺、冻结账号、冻结资金、终止合作、要求乙方支付赔偿金等处罚。
    5.3	如乙方销售的商品或提供的服务导致纠纷或政府部门查处，乙方须按甲方的要求提供必要的证明材料和相关证据，必要时应与甲方一起参加诉讼或授权甲方代其进行诉讼。乙方同意赔偿给甲方造成的一切损失，甲方有权要求乙方直接出面解决上述诉讼与非诉纠纷，指令乙方向行政部门直接交纳罚款、承担因此发生的诉讼费、律师费、交通费、向第三方（包括但不限于权利人或顾客）支付的赔偿费及其它一切合理支出，包括直接损失与间接损失。
    5.4	若经甲方查证属实或任何第三方（包括但不限于顾客）向甲方投诉乙方存在下列情形的：乙方销售侵权、假冒伪劣商品的；销售方式、宣传图片等侵权或违法的；乙方销售国家禁止流通、限制流通商品的；乙方提供非法服务的；乙方销售的产品被政府或相关有权机构检出有质量问题的；其他甲方根据相关法律法规或已发布的规则判定为不宜继续销售的情形。甲方可作下列处理：
    1)、	甲方对该商品进行下架处理，并通知乙方提供相关授权经营证明文件，乙方应在2个工作日内提供。若乙方不能提供的，甲方有权解除本协议，并有权就由此给甲方造成的损失要求乙方承担赔偿责任；
    2)、	若经查投诉属实，甲方有权解除本协议，可视乙方的违约情形要求乙方支付不低于一万元的违约金，违约金不能弥补甲方损失的部分，甲方有权向乙方追偿；同时甲方有权扣除乙方的全部履约保证金。
    5.5	乙方如出现下列情形，包括但不限于：商品缺、断货，顾客投诉问题未解决，未能履行销售或促销承诺，未及时送货及随意取消顾客订单等，甲方有权解除本协议，同时甲方保留向乙方追索由此造成的全部直接或间接损失的权利。
    5.6	如因上述条款所列原因致乙方被甲方处罚或停止合作，乙方仍需继续执行售后服务并对已售出商品承担一切责任。
    5.7	本协议一方不履行本协议义务或者履行义务不符合本协议约定给另一方造成损失的，应承担损害赔偿责任。
    5.8	在本协议有效期限内，未经双方协商一致，乙方不得擅自终止本协议，或者将网上商铺经营权等其他权益转让给任何第三方，或者与任何第三方合作经营，否则，甲方有权解除本协议，并有权要求乙方就由此给甲方造成的直接或间接损失承担赔偿责任。
    5.9	乙方之代理人、受任人、受雇人、合伙人等的一切行为均代表乙方，乙方应对其代理人、受任人、受雇人、合伙人的行为承担法律责任。
    5.10 除本协议另有明确约定外，任何一方违反本协议约定的，应根据法律法规的规定承担违约责任。
    6	有限责任
    6.1	甲方对基于本协议为乙方提供的服务，包括提供该等服务所涉及的信息和技术，不作任何明示或默示的保证，该等保证包括但不限于提供服务或服务所涉及的信息和技术的适用性、正确性、持续性、准确性、可靠性、完整性、及时性，及适用于某一特定用途等。
    6.2	使用服务下载或者获取任何资料的行为均出于乙方的独立判断并自行承担风险。乙方独自承担因此对其电脑系统或资料灭失造成的损失，甲方不承担任何责任。 
    6.3	不论在何种情况下，甲方均不对由于 Internet 连接故障，电脑、通讯或其他系统的故障，电力故障，黑客攻击，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产资料不足，火灾，洪水，风暴，爆炸，不可抗
    力，战争，政府行为，国际、国内法院的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。 
    6.4	乙方在此同意并接受甲方在任何情况下都无需向乙方或第三方在使用服务时对甲方在传输或联络中的迟延、不准确、错误或疏漏等及因此而致使的损害负责。
    6.5	甲方保留在任何时候自行决定对服务及其相关功能、应用软件变更、升级的权利。甲方进一步保留在服务中开发新的模块、功能和软件或其它语种服务的权利。上述所有新的模块、功能、软件或其他语种服务的提供，除非甲方另有说明，否则仍适用本协议。服务随时可能因甲方的单方判断而被增减或修改，或因定期、不定期的维护而暂缓提供，甲方应就该等变更及时通知乙方。
    7	反商业贿赂条款
    7.1	 甲乙双方都清楚并愿意严格遵守中华人民共和国反商业贿赂的法律规定，双方都清楚任何形式的贿赂和贪污行为都将触犯法律，并将受到法律的严惩。
    7.2	 甲方或乙方均不得向对方或对方经办人或其他相关人员索要、收受、提供、给予本协议约定外的任何利益，包括但不限于明扣、暗扣、现金、购物卡、实物、有价证券、旅游或其他非物质性利益等，但如该等利益属于行业惯例或通常做法，则须在协议中明示。
    7.3	甲方严格禁止甲方经办人员的任何商业贿赂行为。甲方经办人发生本条第8.2款所列示的任何一种行为，都是违反甲方公司制度的，都将受到甲方公司制度和国家法律的惩处。
    7.4	本公司（甲方）郑重提示：本公司（甲方）反对乙方或乙方经办人员为了本协议之目的与本协议以外的任何第三方发生本条第7.2款所列示的任何一种行为，该等行为都是违反国家法律的行为，并将受到国家法律的惩处。
    7.5	如因一方或一方经办人违反上述第7.2款、第7.3款、第7.4款之规定，给对方造成损失的，应承担损害赔偿责任。
    7.6	本条所称“其他相关人员”是指甲乙方经办人以外的与本协议有直接或间接利益关系的人员，包括但不仅限于本协议经办人的亲友。
    8	协议的解除与终止
    8.1 本协议首次有效期至    年   月   日止。本协议有效期届满前30日内任何一方均未向对方书面提出异议的，本协议将自动续展，每次续展的期限为一年；虽有前述约定，但如果双方续签新的康美中药城网络交易平台服务合作协议，则本协议自新的康美中药城网络交易平台服务合作协议生效之前一日自动失效。
    8.2	除本协议另有约定外，本协议任何一方均可以提前三十（30）自然日书面通知的方式终止本协议。
    8.3	如乙方违反康美中药城网站的任何规则或本协议中的任何承诺或保证，包括但不限于本协议项下的任何约定，甲方都有权立刻终止本协议，且有权按本协议的相关约定及康美中药城网站的有关规则对乙方追究责任。如乙方销售假冒他人商标的商品、或第三方多次投诉其商品质量或服务质量，甲方除有权立即终止或中止本协议外，还有权全额划扣其所有履约保证金，作为乙方的违约金。
    8.4	除本协议另有约定外，因乙方与任何第三方之间存在争议，甲方认为其合法权益可能受到影响时，或出现本协议其他条款中规定的甲方可以解除本协议的情形时，甲方可以单方解除本协议。
    8.5	除本协议另有约定外，无论本协议因何原因解除或终止，在本协议解除或终止前的行为所导致的任何赔偿和责任，乙方必须完全且独立地承担。虽有前述约定，乙方理解，甲方根据业务发展的需要有权在及时通知乙方的情况下提前暂停或终止本协议、暂停或终止提供本协议项下的服务、及/或将本协议项下的权利或义务部分或全部转让给第三方，但甲方应确保妥善解决本协议的暂停或终止、本协议项下服务的暂停或终止、及/或转让事宜。
    9	不可抗力
    9.1	本协议任何一方由于遭遇战争或严重的水灾、火灾、台风和地震等自然灾害，以及双方同意的可作为不可抗力的其他事件而影响本协议执行时，双方同意延长履行本协议的期限，延长的期限相当于不可抗力事件所影响的时间。
    9.2	受不可抗力影响的一方应尽快将发生不可抗力事件的情况以书面方式通知对方，并于七天内以挂号信件或其它有效方式将有关当局出具的证明文件提交给另一方进行确认。
    10	法律适用和争议解决
    10.1 本协议之签署、效力、解释和执行以及本协议项下争议之解决均适用中华人民共和国法律（为本协议目的，不包括香港、澳门、台湾法律）。
    10.2 在签署、履行本协议中发生的争议或纠纷，双方应通过友好协商解决；协商不成的，任何一方有权将争议提交至甲方住所地人民法院诉讼解决。诉讼费用由败诉方负担。
    11	本协议的内容
    11.1 本协议内容包括本协议正文及本协议附件（包括但不限于所有甲方已经发布的或将来可能发布的各类规则）。本协议附件为本协议不可分割的一部分，与本协议正文
    具有同等法律效力。
    11.2 乙方在使用网站提供的各项服务的同时，承诺接受并遵守康美中药城网站各项相关规则的规定。甲方有权根据需要不时地制定、修改及/或变更本协议正文及/或本协议附件，并在康美中药城网站上以公示形式通知乙方。本协议正文及/或本协议附件的任何制定、修改及/或变更一经公布即自动生效，成为本协议的一部分。如果乙方不同意该等制定、修订及/或变更，可自甲方公示后3个工作日内以书面通知方式提出终止本协议，在此种情况下，本协议自双方账务结清、权利义务履行完毕之日终止；否则即视为乙方接受经制定、修订及/或变更的本协议正文及/或本协议附件。登录或继续使用康美中药城网站商家账户视为乙方接受经制定、修订及/或变更后的本协议正文本及/或本协议附件。
    12	本协议的成立、生效及期限
    12.1 本协议须同时满足下述条件方得成立：
    (1)	乙方接受本协议全部内容；
    (2)	甲方以书面形式（包括但不限于电子邮件形式）通知乙方本协议成立。
    本协议自甲方以书面形式（包括但不限于电子邮件形式）通知乙方本协议成立时方得成立。本协议一式三份，一经成立即生效。
    13	其他
    13.1 在本协议有效期内，甲方提前以书面形式通知乙方即可将其在本协议项下的权利义务转让给其关联公司。
    13.2 乙方在签订本协议前已认真阅读本协议全部内容。签订本协议，即视为乙方对本协议载明的全部内容全部了解并完全接受。
    </textarea>
    <h3 class="step--sub-title fn-mt20">核准运营类目及平台佣金比例</h3>
    <table width="100%" border="0" cellpadding="0" cellspacing="0" class="table table-bordered">
        <thead>
        <tr class="tablesbg">
            <th colspan="2" class="shoptL">经营类目佣金比例：</th>
        </tr>
        </thead>
        <tbody>
        <s:iterator value="suppliserCategoryList" var="supplierCategory">
            <tr>
                <s:if test="#supplierCategory.categoryParentId == 0">
                    <td class="width160 shoptR"><s:property value="#supplierCategory.categoryName"/></td>
                    <td class="shoptL">
                        <ul class="commission">
                            <s:iterator value="suppliserCategoryList" var="supplierCategory1">
                                <s:if test="#supplierCategory1.categoryParentId == #supplierCategory.categoryId">
                                    <li><s:property value="#supplierCategory1.categoryName"/><em><s:property value="#supplierCategory1.commissionRatio"/>%</em></li>
                                </s:if>
                            </s:iterator>
                        </ul>
                    </td>
                </s:if>
            </tr>
        </s:iterator>
        </tbody>
    </table>
    <p class="ui-well ui-well-sm fn-gray fn-mt20">
        <label class="fn-mr20">
             <input class="ui-form-checkbox fn-mr5" id="checkboxAgrement" name="checkboxAgrement" value="" 
                    type="checkbox">我已看过并同意《康美中药城开放平台服务协议》
        </label>
    </p>
    <div class="apply-step-form fn-mt10 fn-text-ct">
        <form id="frm" action="goIndex.action" method="post" name="" class="ui-form ui-form-vertical fn-t20">
        <input type="hidden" id="loginId" value="${showUserinfo.loginId}" name="loginId"/>
            <div class="ui-form-item">
                <a class="ui-button ui-button-success ui-button-lg" id="next1"  href="javascript:void(0);">进入康美中药城商家平台</a>
            </div>
        </form>
    </div>
</div>